Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: Maths
zh_cn: 数学

source: Maximal horizontal speed of the view.
zh_cn: 视野最大水平速度。

source: Maximal vertical speed of the view.
zh_cn: 视野的最大垂直速度。

source: Menus.
zh_cn: 菜单。

source: Miscellaneous
zh_cn: 杂项函数

source: More About Async Events
zh_cn: 关于异步事件

source: More About Backgrounds
zh_cn: 关于背景

source: More About Objects
zh_cn: 关于物体

source: More About Rooms
zh_cn: 关于房间

source: More About Sprites
zh_cn: 关于精灵图像

source: More information can be found here.
zh_cn: 更多信息可以点击 这里.

source: More information on this can be found below.
zh_cn: 更多信息在本节的下面会介绍。

source: More information on this can be found in the Advanced Use section of the manual under More About objects.
zh_cn: 更多信息请查看 更多关于物体。

source: Most games need you to make sprites like this for all the things in your game world, from enemies to power-ups, from walls to menus, and when you start to make a game you normally collect or create a set of nice sprites for the objects you are going to use.
zh_cn: 大多数游戏需要你像这样制作精灵，无论是敌人还是墙还是菜单。当你开始制作一个游戏你需要为你的物体收集或者创造一组好的精灵。

source: Most of the time they have a sprite associated with them so that you see them in the game rooms, but sometimes they are used as a "behind the scenes" controller to do things related to the user or for timing, etc...
zh_cn: 大多数时候它们拥有一个精灵使得你可以在房间中看到它们。但有时它们也作为 "幕后" 操控者，控制玩家相关信息、分数或时间等等...

source: Mouse, Keyboard and Other Controls
zh_cn: 鼠标、键盘和其它操作方式

source: Movement and Collisions
zh_cn: 移动和碰撞

source: Much easier to keep track of one array than multiple variables.
zh_cn: 一个数组更容易跟踪，胜过多个变量。

source: Nearly all iOS devices are compatible with GameMaker: Studio including:
zh_cn: 几乎所有IOS设备都兼容 GameMaker: Studio，它们包括:

source: Networking
zh_cn: 联网

source: New game data downloaded from the cloud (following a cloud_synchronise call)
zh_cn: 从云端下载新的游戏数据(在 cloud_synchronise后调用)。

source: New users should definitely start at the beginning with the Using GameMaker: Studio section as it has all the information you need to get started as quickly as possible, however users of previous GameMaker versions can probably skip to the Advanced Use section to see what's new in this version.
zh_cn: 新用户应该明确的从 使用 GameMaker: Studio 部分开始，它包括所有快速入门的知识，曾经使用过之前GameMaker版本 可以跳过这部分到 高级应用 部分，以查阅这个版本的新内容。

source: Next Page
zh_cn: 下一页

source: Next it is compared with the results of the different expressions after each of the case statements.
zh_cn: 下一步与case后面的表达式的结果进行比较。

source: Next you can choose the sprite for the object should you wish it to have one.
zh_cn: 接下来你可以为你的物体选择一个精灵。

source: Next you should start selecting the fonts to preview using the drop-down menu "Font" on the left.
zh_cn: 下来你可以通过左侧的“Font”下拉框来选择并预览不同的字体。

source: Next, you can place one (or multiple!) instances of any objects you have created into the room.
zh_cn: 接下来，你可以放一个 (或多个!) 实例到房间里。

source: Next: Activation
zh_cn: 下一页: 激活

source: Next: Advanced Use
zh_cn: 下一章: 高级使用

source: Next: Assignments
zh_cn: 下一页: 赋值

source: Next: Backgrounds
zh_cn: 下一章: 背景

source: Next: Comments in Code
zh_cn: 下一页: 脚本注释Comments in Code

source: Next: Defining Objects
zh_cn: 下一章: 定义物体

source: Next: Distributing Your Game
zh_cn: 下一章: 发布你的游戏

source: Next: Expressions
zh_cn: 下一页: 表达式

source: Next: Extension Packages
zh_cn: 下一章: 扩展包

source: Next: Functions
zh_cn: 下一页t: 函数

source: Next: GameMaker: Studio Overview
zh_cn: 下一章: GameMaker: Studio 概述

source: Next: Installation and System Requirements
zh_cn: 下一章: 安装及系统要求

source: Next: Keywords
zh_cn: 下一页: Keywords

source: Next: Loading Sprites
zh_cn: 下一章: 加载精灵

source: Next: Paths
zh_cn: 下一章: 路径

source: Next: Reference
zh_cn: 下一章: GML参考

source: Next: Scripts
zh_cn: 下一章: 脚本

source: Next: Sounds And Music
zh_cn: 下一章: 声音和音乐

source: Next: The "Break" Statement
zh_cn: 下一页: “Break”语句

source: Next: The "Continue" Statement
zh_cn: 下一页: “Continue”语句

source: Next: The "Do" Statement
zh_cn: 下一页: “Do”语句

source: Next: The "Exit" Statement
zh_cn: 下一页: “Exit”语句

source: Next: The "For" Statement
zh_cn: 下一页: “For”语句

source: Next: The "If" Statement
zh_cn: 下一页: “if”语句

source: Next: The "Repeat" Statement
zh_cn: 下一页: “Repeat”语句

source: Next: The "Switch" Statement
zh_cn: 下一页: “Switch”语句

source: Next: The "While" Statement
zh_cn: 下一页: “While”语句

source: Next: The "With" Construction
zh_cn: 下一页: “With”结构

source: Next: The Edit Menu
zh_cn: 下一章: 编辑菜单

source: Next: The Graphical User Interface
zh_cn: 下一章: 用户图形界面

source: Next: The Windows Menu
zh_cn: 下一章: 窗口菜单

source: Next: Time Lines
zh_cn: 下一章: 时间轴

source: Next: Variables and Variable Scope
zh_cn: 下一章: 变量及变量的作用域

source: Next: Views
zh_cn: 下一页: Views

source: Next: application_get_position
zh_cn: 下一页: application_get_position

source: Next: application_surface
zh_cn: 下一页: application_surface

source: Next: application_surface_draw_enable
zh_cn: 下一页: application_surface_draw_enable

source: Next: application_surface_enable
zh_cn: 下一页: application_surface_enable

source: Next: application_surface_is_enabled
zh_cn: 下一页: application_surface_is_enabled

source: Next: display_get_dpi_x
zh_cn: 下一页: display_get_dpi_x

source: Next: display_get_dpi_y
zh_cn: 下一页: display_get_dpi_y

source: Next: display_get_gui_height
zh_cn: 下一页: display_get_gui_height

source: Next: display_get_gui_width
zh_cn: 下一页t: display_get_gui_width

source: Next: display_get_height
zh_cn: 下一页: display_get_height

source: Next: display_get_orientation
zh_cn: 下一章: display_get_orientation

source: Next: display_get_width
zh_cn: 下一页: display_get_width

source: Next: display_get_windows_alternate_sync
zh_cn: 下一页: display_get_windows_alternate_sync

source: Next: display_get_windows_vertex_buffer_method
zh_cn: 下一页: display_get_windows_vertex_buffer_method

source: Next: display_mouse_get_y
zh_cn: 下一页: display_mouse_get_y

source: Next: display_mouse_set
zh_cn: 下一页: display_mouse_set

source: Next: display_reset
zh_cn: 下一页: display_reset

source: Next: display_set_gui_maximise
zh_cn: 下一页: display_set_gui_maximise

source: Next: display_set_gui_size
zh_cn: 下一页: display_set_gui_size

source: Next: display_set_windows_alternate_sync
zh_cn: 下一页: display_set_windows_alternate_sync

source: Next: display_set_windows_vertex_buffer_method
zh_cn: 下一页: display_set_windows_vertex_buffer_method

source: Next: ds_grid_add_disk
zh_cn: 下一个： ds_grid_add_disk

source: Next: ds_grid_add_grid_region
zh_cn: 下一页： ds_grid_add_grid_region

source: Next: ds_grid_add_region
zh_cn: 下一页： ds_grid_add_region

source: Next: ds_grid_multiply
zh_cn: 下一页： ds_grid_multiply

source: Next: ds_grid_read
zh_cn: 下一页： ds_grid_read

source: Next: ds_grid_set
zh_cn: 下一页： ds_grid_set

source: Next: point_direction
zh_cn: 下一页: point_direction

source: Next: push_cancel_local_notification
zh_cn: 下一页： push_cancel_local_notification

source: Next: push_get_first_local_notification
zh_cn: 下一页： push_get_first_local_notification

source: Next: push_get_next_local_notification
zh_cn: 下一页： push_get_next_local_notification

source: Next: push_local_notification
zh_cn: 下一页: push_local_notification

source: Next: screen_save
zh_cn: 下一页: screen_save

source: Next: screen_save_part
zh_cn: 下一页: screen_save_part

source: Next: surface_copy
zh_cn: 下一页: surface_copy

source: Next: surface_copy_part
zh_cn: 下一页: surface_copy_part

source: Next: surface_create
zh_cn: 下一页: surface_create

source: Next: surface_create_ext
zh_cn: 下一页: surface_create_ext

source: Next: surface_exists
zh_cn: 下一页: surface_exists

source: Next: surface_free
zh_cn: 下一页: surface_free

source: Next: surface_get_height
zh_cn: 下一页: surface_get_height

source: Next: surface_get_texture
zh_cn: 下一页: surface_get_texture

source: Next: surface_get_width
zh_cn: 下一页: surface_get_width

source: Next: surface_getpixel
zh_cn: 下一页: surface_getpixel

source: Next: surface_getpixel_ext
zh_cn: 下一页: surface_getpixel_ext

source: Next: surface_reset_target
zh_cn: 下一页: surface_reset_target

source: Next: surface_resize
zh_cn: 下一页: surface_resize

source: Next: surface_save
zh_cn: 下一页: surface_save

source: Next: surface_save_part
zh_cn: 下一页: surface_save_part

source: Next: surface_set_target
zh_cn: 下一页: surface_set_target

source: Next: surface_set_target_ext
zh_cn: 下一页: surface_set_target_ext

source: Next: view_angle
zh_cn: 下一页: view_angle

source: Next: view_current
zh_cn: 下一页 view_current

source: Next: view_enabled
zh_cn: 下一页: view_enabled

source: Next: view_hborder
zh_cn: 下一页: view_hborder

source: Next: view_hport
zh_cn: 下一页: view_hport

source: Next: view_hspeed
zh_cn: 下一页 view_hspeed

source: Next: view_hview
zh_cn: 下一页: view_hview

source: Next: view_object
zh_cn: 下一页: view_object

source: Next: view_surface_id
zh_cn: 下一页: view_surface_id

source: Next: view_vborder
zh_cn: 下一页: view_vborder

source: Next: view_visible
zh_cn: 下一页: view_visible

source: Next: view_vspeed
zh_cn: 下一页: view_vspeed

source: Next: view_wport
zh_cn: 下一页: view_wport

source: Next: view_wview
zh_cn: 下一页: view_wview

source: Next: view_xport
zh_cn: 下一页: view_xport

source: Next: view_xview
zh_cn: 下一页: view_xview

source: Next: view_yport
zh_cn: 下一页: view_yport

source: Next: view_yview
zh_cn: 下一页: view_yview

source: Next: window_center
zh_cn: 下一页: window_center

source: Next: window_device
zh_cn: 下一页: window_device

source: Next: window_get_caption
zh_cn: 下一页: window_get_caption

source: Next: window_get_colour
zh_cn: 下一页: window_get_colour

source: Next: window_get_cursor
zh_cn: 下一页: window_get_cursor

source: Next: window_get_fullscreen
zh_cn: 下一页: window_get_fullscreen

source: Next: window_get_height
zh_cn: 下一页: window_get_height

source: Next: window_get_visible_rects
zh_cn: 下一页: window_get_visible_rects

source: Next: window_get_width
zh_cn: 下一页: window_get_width

source: Next: window_get_x
zh_cn: 下一页: window_get_x

source: Next: window_get_y
zh_cn: 下一页: window_get_y

source: Next: window_handle
zh_cn: 下一页: window_handle

source: Next: window_has_focus
zh_cn: 下一页: window_has_focus

source: Next: window_mouse_get_x
zh_cn: 下一页: window_mouse_get_x

source: Next: window_mouse_get_y
zh_cn: 下一页: window_mouse_get_y

source: Next: window_set_caption
zh_cn: 下一页: window_set_caption

source: Next: window_set_colour
zh_cn: 下一页: window_set_colour

source: Next: window_set_cursor
zh_cn: 下一页: window_set_cursor

source: Next: window_set_fullscreen
zh_cn: 下一页: window_set_fullscreen

source: Next: window_set_max_height
zh_cn: 下一页: window_set_max_height

source: Next: window_set_max_width
zh_cn: 下一页: window_set_max_width

source: Next: window_set_min_height
zh_cn: 下一页: window_set_min_height

source: Next: window_set_min_width
zh_cn: 下一页: window_set_min_width

source: Next: window_set_position
zh_cn: 下一页: window_set_position

source: Next: window_set_rectangle
zh_cn: 下一页: window_set_rectangle

source: Next: window_set_size
zh_cn: 下一页: window_set_size

source: Next: window_view_mouse_get_x
zh_cn: 下一页: window_view_mouse_get_x

source: Next: window_view_mouse_get_y
zh_cn: 下一页 window_view_mouse_get_y

source: Next: window_views_mouse_get_x
zh_cn: 下一页: window_views_mouse_get_x

source: Next: window_views_mouse_get_y
zh_cn: 下一页: window_views_mouse_get_y

source: No Configurations
zh_cn: 没有 Configurations (配置)

source: No DSP (Developer Services Portal)
zh_cn: 没有 DSP (Developer Services Portal 开发者服务门户)

source: No Extra Target Modules
zh_cn: 没有 Extra Target Modules (扩展输出模块)

source: No Source Control
zh_cn: 没有 Source Control (源控制)

source: No Steam API integration
zh_cn: 没有 Steam API integration (steam API 集成)

source: No Texture Group Control
zh_cn: 没有 Texture Group Control (纹理组控制)

source: No matter what version of GameMaker: Studio you have, you will find that it comes bundled with a stand-alone application called the GameMaker: Player.
zh_cn: 无论你拥有 GameMaker: Studio 的哪个版本，都会发现它捆绑了一个叫 GameMaker: Player 的独立应用。.

source: No new data since you last called cloud_synchronise
zh_cn: 自从上次调用以来cloud_synchronise没有新的数据。

source: Normal surfaces are quite easy to use, but there are a few basic rules to be followed when you use them:
zh_cn: 表面使用很简单，但在使用的时候，也有几个应遵循的基本规则：

source: Normalised Vectors
zh_cn: 规范化向量

source: Normally most instances are visible but sometimes it is useful to have invisible ones - for example, you can use them for way-points to control a moving monster, or to keep track values and perform certain timed actions.
zh_cn: 通常选择可见，但是有时不可见也是有用的。例如，可以使用点方式控制怪物移动，或者跟踪并进行一定的动作。

source: Normally these values are set in the Windows Tab of the Global game Settings but you can change them during the game.
zh_cn: 通常是在 Windows Tab( 在Global game Settings中 ) 里面设置这个值，但是也可以在游戏中更改。

source: Normally you would simply use the Step In button to do this, but you also have one for stepping over code and one for stepping out of the code.
zh_cn: 通常你只需要用跳入按钮来做这件事，不过你还有另外两个选择，一个跳过代码和一个跳出代码。

source: Normally you would try and keep them no larger than the size of the view or display window.
zh_cn: 通常不要超过视野或者显示窗口的大小。

source: Not to mention the fact that all these people are highly experienced: programmers, art designers, sound technicians, etc.
zh_cn: 更不用说，这些人都是经验丰富的程序员、设计师、音响师等。

source: Note how in the code we have used the way that "switch" can check multiple cases and continue if no break is encountered to permit various keys to be used to get the same result.
zh_cn: 注意代码中怎么用的，“switch”可以检测多个条件，如果没有“break”就会继续，以允许多个按键得到相同的结果。

source: Note how the "for" loop variable "i" is used to not only loop through the array, but to draw a number as well as tell GameMaker: Studio where to draw the values to in the room.
zh_cn: 注意“for”是怎么使用“i”的，不仅仅是作为数组的下标，而且也会告诉GameMaker: Studio房间内绘制的位置。

source: Note that all the property forms appear within the main window and you can have open and edit many of them at the same time.
zh_cn: 可以同时打开多个资源的属性。

source: Note that although most modern browsers are capable of running HTML5 games, not all of them support the WebGL standard currently, so we recommend Chrome for testing as that shows all the features supported by the module.
zh_cn: 注意尽管如今的浏览器均可以运行HTML5游戏，但是并不是所有的浏览器都支持 WebGL 标准。所以我们建议使用 Chrome 测试以便显示模块所支持的所有功能。

source: Note that for large buffers, scrolling down through the data will require that you scroll, then release the mouse button for the Debug Module to fetch and display the required data.
zh_cn: 要主要注意对于大的缓冲器来说，需要你滚动页面才能看全数据，之后松开鼠标按键来选取然后显示调试模块中你所需要的数据。

source: Note that if the game is in the foreground when the time for the notification comes, it will not be shown, but the asynchronous event will still trigger.
zh_cn: 需要注意的是，如果推送时程序运行在前台，通知将 不会 被展示，但是异步推送事件 仍会触发。

source: Note that if you are using the legacy audio system to play the sound (or are working on the HTML5 target), this slider is simply the initial volume of the sound and can be changed by setting the volume using the appropriate legacy function.
zh_cn: 注意如果你打算使用传统声音系统播放音乐 (或工作于 HTML5 目标)，滑块是 初始 音量，可以通过适当的函数来改变。

source: Note that if you bought GameMaker: Studio through Steam this option will not be present.
zh_cn: 注意如果通过 Steam 购买了 GameMaker: Studio 就不会出现该选项。

source: Note that if you have any Sony console license or the Xbox One licence as part of your GameMaker: Studio licence, then you will also see an option here to install the appropriate SDK and module resources.
zh_cn: 注意如果你有 Sony 游戏机许可或者 Xbox One 许可作为你的 GameMaker: Studio 许可的一部分，这里也会看到安装的相应 SDK 和模块的资源选项。

source: Note that it looks for all strings (either within "" or '') and so may also include file names in the character ranges.
zh_cn: 注意，这会查找工程中的全部字符串（无论有没有双引号），因此也会包含文件名中的字符。

source: Note that many of these commands can also be given by right-clicking on a resource (or a resource group), and then using the appropriate action from the pop-up menu.
zh_cn: 需要注意的是很多命令也可以通过右键点击资源给出，然后从弹出的菜单中选择相应的命令。

source: Note that multiple case statements can be placed for the same statement.
zh_cn: 注意，同一个语句前可以出现多个case。

source: Note that on the HTML5 target, this value is the height of the browser window, rather than the physical display size.
zh_cn: 需要注意的是HTML5平台，这个值是 浏览器窗口的高度，而不是显示器的物理尺寸。

source: Note that on the HTML5 target, this value is the width of the browser window, rather than the physical display size.
zh_cn: 需要注意的是HTML5平台，这个值返回的是 浏览器窗口的宽度，而不是显示器的物理尺寸。

source: Note that the above code has an instance_exists() call in the code block.
zh_cn: 注意上述代码块调用了 instance_exists() 函数。

source: Note that the better the quality, the larger the file, and that increasing this on a low quality audio file will not improve the quality noticeably and only bloat the final game.
zh_cn: 注意品质越高，文件越大，如果作用于本身就是低品质的音频文件，不会 提升品质，而只会使得游戏变得庞大。

source: Note that the time line can be started at any time in-game, so moment 0 is just the moment in which the time line starts and not the moment the game or room starts.
zh_cn: 注意，时间轴可以在游戏中的任意时刻被启动，因此时间轴中的时刻0代表的是时间轴启动的那个时刻，而不是游戏或者房间开始的时刻。

source: Note that this can also be used for comparing variables in GameMaker: Studio and you may see this in examples and other peoples codes.
zh_cn: 注意，你 也 可以用它 >在GameMaker: Studio中比较变量的大小，这个你可能会在例子里和其它人的代码中看到。

source: Note that this can also be set in the Global Game Settings and that it is only applicable Windows 7 and above - it will just use the default method if you have this option ticked and run on XP or Vista - and that it does not switch it on or off, for that you would use the function display_reset().
zh_cn: 注意，你也可以在全局游戏设定中设置并且只适用 Windows 7 或更高的系统 - XP 或者 Vista 上，勾上这个选项也将使用默认的方法 - 并且它 不会 开启或关闭垂直同步，因为那个你将需要使用到函数 display_reset()。

source: Note that this does not report if v-sync is active or not (you can switch function display_reset()), and that you can set the v-sync method from the Global Game Settings or using the function display_set_windows_alternate_sync().
zh_cn: 注意这个函数并不是报告垂直同步是否激活（这个通过切换函数 display_reset()实现），你可以在全局游戏设定中或者或者使用函数 display_set_windows_alternate_sync()来设置垂直同步的方法。

source: Note that this may affect the games performance and that not all information is available in real time.
zh_cn: 不过要注意这样也许会影响游戏表现，而且并不是所有的信息都会实时有效。

source: Note that this will neither crop nor stretch the contents of the surface, but rather it destroys the current surface and recreates it with the same handle (surface_id) with the new dimensions, meaning that it will need to be cleared and drawn to again (unless it is the application_surface in which case GameMaker: Studio will do this automatically).
zh_cn: 注意，这即不剪切也不会拉伸表面层的内容，而是销毁现在的表面，并使用同一个句柄（surface_id）、新的尺寸重建表面，意味着它需要清理并再次绘制（除非它是 application_surface ， GameMaker: Studio 将自动处理）。

source: Note that while the rest of the audio properties are configuration specific, the audio group setting is not and a sound will belong to the same group on all configurations that you use.
zh_cn: 注意，当其余的音频属性是特定的配置，音频组设置和它们的设置 不 一样，而是只使用音频组设置。

source: Note that you can select all targets or none of them simply by clicking the buttons in the properties window.
zh_cn: 注意，你可以在属性窗口中点击相应按钮来全选、全不选目标平台。

source: Note that you cannot re-asign arrays or data structures in this way, but you can change some of their contents (you cannot change the "key" values in maps, nor the priority value for priority queues).
zh_cn: 需要注意你不能以这种方式重分配数组或者数据结构，但你可以改变他们中的某些内容（不能改变地图数据结构中的“关键”值，也不能改变优先队列里的优先值） 。

source: Note that you cannot use the special keyword "all" with this method to target all instances, but you can use the keywords "other" and "self" without issues.
zh_cn: 注意，这种方法你不能使用特定的关键词 "all"， 但是其它的关键词 "other" 和 "self" 没有问题。

source: Note the difference here, as if you use exit in a script is will simply exit the script and return to the code that called the script, however if you use this event in a code block from within an object, it will exit the entire event even if there are various separate code blocks after the function has been called.
zh_cn: 注意这儿的不同点，如果只是简单的在脚本中使用exit，它将跳出脚本并返回调用脚本的代码的位置，然后如果在物体的事件中使用，它将跳出 整个事件，即使后面还有独立的代码块。

source: Note the use of the word temporary here!
zh_cn: 注意这个词 临时 ！

source: Note too that a persistent object will still have its Game Start, Game End, Room Start and Room End events triggered, however if you restart the game (with, for example, the game_restart() function) all persistent objects will be removed and only exist when created again by the game.
zh_cn: 需要注意的是持续性物体也有它自己的 Game Start、Game End、Room Start 和 Room End 事件触发器，但是当重启游戏 (例如使用 game_restart() 函数)，所有现存的物体将会被移除并且再次被创建一次。

source: Now let's expand our array to include different positions...
zh_cn: 现在我们给数组扩展三个位置。

source: Now that we know what a normal array looks like, let's look at a 2D (two dimensional) array.
zh_cn: 现在我们知道了普通的数组，再看看2D（二维）数组。

source: Now the instances you have placed will come to life because of the actions defined in their object create events and they will start reacting to each other due to actions placed in the object collision events.
zh_cn: 现在你放置的实例拥有生命力了，因为你为它们的物体定义了创建事件所以它们开始彼此发生 碰撞事件等。

source: Now you can drag actions to the list as for object events.
zh_cn: 然后你就可以向这个时刻中拖拽动作，就如同物体的事件一样。

source: Now you would expect the final array to hold the values 900, 800, 700, etc...
zh_cn: 现在你期望最后的数组保存的值是900、 800、 700、等等……

source: Now, I say "based on" because you don't actually place objects directly into the game rooms, but rather you place instances of these objects which are basically copies (or clones if you prefer) of the object resource.
zh_cn: 物体的 实例 和物体是两码事，实例是物体的拷贝 (喜欢的话也可以称为克隆)。

source: Now, making computer games is not normally a simple thing and the commercial games you buy nowadays typically take two or three years of development with teams of anywhere between 10 and 50 people and budgets that can easily reach millions of dollars.
zh_cn: 现在, 制作电脑游戏并不是一件简单的事情，制作一个商业游戏您通常需要花费两年到三年的时间聘请10-50人去制作，很容易达到数百万美元。

source: Now, the default for GameMaker: Studio is that the game window (or background canvas) is the same size as the room, however when you activate views, this behaviour changes and the total size of the bounding box for all view ports is used.
zh_cn: 现在默认，对于 GameMaker: Studio ，游戏窗口（或者背景画布）和房间一样大，然而当你激活视野，这个行为会发生变化，并且使用得是所有视口的边界框的总和 。

source: Now, these Rooms are flat 2 dimensional spaces but they can contain 3D-looking graphics as well depending on how you use them.
zh_cn: 现在，这些 Rooms 是二维空间，但是也可以包含三维图形，取决于您如何使用它。

source: Now, this can be done by simply creating an array of positions within the room and then having an instance move between them, but that can be a chore to set up and is difficult to change, test and adapt for different instance.
zh_cn: 一般说来只需要简单的创建一个包含了房间中一些位置坐标的数组然后让你的实例在这些位置之间运动即可。但是创建这个数组是一件繁琐的操作，并且难以进行修改、测试和应用在不同实例上。

source: Now, this may sound complicated when written like that, but you should interpret it as:
zh_cn: 听起来有点复杂，也可以这样解释：

source: Now, when you run your game in debug mode it will pause at the point (or points) that you have defined.
zh_cn: 现在，当你在调试模块中运行游戏的时候，它就会暂停在你定下的断点（们）上了。

source: Now, you can try to achieve this by using the alarm events but when things get too complicated this won't work any more, especially as you are limited to only twelve alarms.
zh_cn: 通常，你可以使用定时事件来完成这件事，但是当你的要完成的事情过于复杂的时候这根本行不通，特别是你只有12个定时器可以用。

source: Object whose instance must remain visible in the view.
zh_cn: 保持在视野中可见的物体。

source: Objects and Instances
zh_cn: 物体和实例

source: Objects are never created, rather they are used to create instances...
zh_cn: 物体 永远不会 被创建，只是创建了它们的 实例...

source: Objects are a special resource that we use to control aspects of a game and to do specific things.
zh_cn: 物体是一个用来控制游戏各方面的具体事件的特殊资源。

source: Objects are the fundamental "building blocks" within GameMaker: Studio.
zh_cn: Objects 是 GameMaker: Studio 中的 "积木"。

source: Obsolete Display Functions
zh_cn: 弃用显示器函数

source: Obsolete Functions
zh_cn: 弃用函数

source: Obviously, you want to get started as quickly as possible, so GameMaker: Studio is bundled with a number of tutorials and demos which you can import and use to get straight to work.
zh_cn: 显然，您想尽快地上手，所以 GameMaker: Studio 捆绑了一些教程和演示，您可以直接导入并且运行他们。
